# Инструкция для работы с Markdown

## Выделение текста

Чтобы выделить текст курсивом необходимо обрамить его звездочками (*) или знаком нежнего подчеркивания (_). Например, *вот так* или _вот так_.

Чтобы выделить текст полужирными необходимо обрамить его двойными звездочками (**) или двойны знаком нижнего подчеркивания (__). Например, **вот так** или __вот так__.

Альтернативные способы выделения текста жирным или курсивом нужны для того, чтобы мы могли совмещать оба этих способа. Например, _текст может быть выделен курсивом и приэтом быть **полужирным**_.

## Списки

Чтобы добавить ненумерованные списки, необходимо пункты выделить звездочкой (*) или знаком +. Например, вот так:
* Элемент 1
* Элемент 2
* Элемент 3
+ Элемент 4

Чтобы добавить нумерованные списки, необходимо  пункты просто пронумеровать. Например, вот так:
1. Первый пункт
2. Второй пункт

## Работа с изображениями

Чтобы вставить изображение в текст, достаточно написать следующее:
![Это хищник. Нейрохищник](картинка.webp)

## Ссылки

Чтобы вставить в текст ссылку достаточно сделать следующее:
[Гугл переводчик](https://translate.google.ru/?sl=auto&tl=ru&op=translate "здесь можно перевести")

## Команды git

* git version (проверка версии)
* git status (узнать какие изменения или сохранения произошли)
* git add (добавление файла, который нужно отслеживать)
* git commit -m (сохранение изменений с комментарием)
* git log (журнал изменений)
* git checkout (переход на другую ветку)
* git branch (проверить на какой ветке находишься)
* git merge (удалить ветку)
* clear (очистка терминала)
* git log (посмотреть историю веток)
* git push (направить с локального репозитория на github)
* git pull (стянуть с удаленного репозитория на github акктуальную информацию)
## Работа с удаленными репозиториями

1. Создать аккаунт на Github.com
2. Создать локальный репозиторий (необходимо чтобы был хотя бы один commit)
3. "Подружить" ваш локальный и удаленный репозитории. Github при создании нового репозитория, подскажет как это можно сделать
4. Отправить (push) локальный репозиторий на удаленный (на Github), при этом вам, возможно, нужно будет авторизоваться на удаленном репозитории (делается один раз)
5. Провести изменения "с другого компьютера".
6. Скачать (pull) актуальное состояние из удаленного репозитория.

# Спасибо за внимание :)
